###############################################################################
# Created by write_sdc
# Thu Nov 13 20:33:13 2025
###############################################################################
current_design bary_pipe_m
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk_i}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {busy_o}]
set_load -pin_load 0.1900 [get_ports {discard_o}]
set_load -pin_load 0.1900 [get_ports {init_o}]
set_load -pin_load 0.1900 [get_ports {sstream_o}]
set_load -pin_load 0.1900 [get_ports {mstream_o[115]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[114]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[113]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[112]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[111]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[110]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[109]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[108]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[107]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[106]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[105]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[104]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[103]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[102]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[101]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[100]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[99]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[98]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[97]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[96]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[95]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[94]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[93]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[92]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[91]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[90]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[89]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[88]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[87]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[86]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[85]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[84]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[83]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[82]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[81]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[80]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[79]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[78]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[77]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[76]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[75]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[74]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[73]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[72]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[71]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[70]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[69]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[68]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[67]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[66]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[65]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[64]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[63]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[62]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[61]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[60]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[59]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[58]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[57]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[56]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[55]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[54]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[53]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[52]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[51]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[50]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[49]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[48]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[47]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[46]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[45]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[44]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[43]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[42]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[41]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[40]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[39]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[38]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[37]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[36]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[35]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[34]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[33]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[32]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[31]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[30]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[29]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[28]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[27]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[26]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[25]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[24]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[23]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[22]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[21]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[20]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[19]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[18]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[17]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[16]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[15]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[14]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[13]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[12]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[11]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[10]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[9]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[8]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[7]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[6]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[5]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[4]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[3]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[2]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[1]}]
set_load -pin_load 0.1900 [get_ports {mstream_o[0]}]
set_input_transition 0.6100 [get_ports {clk_i}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
