###############################################################################
# Created by write_sdc
# Thu Oct  2 19:45:56 2025
###############################################################################
current_design busarb_2_2
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk_i}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {mports_o[135]}]
set_load -pin_load 0.1900 [get_ports {mports_o[134]}]
set_load -pin_load 0.1900 [get_ports {mports_o[133]}]
set_load -pin_load 0.1900 [get_ports {mports_o[132]}]
set_load -pin_load 0.1900 [get_ports {mports_o[131]}]
set_load -pin_load 0.1900 [get_ports {mports_o[130]}]
set_load -pin_load 0.1900 [get_ports {mports_o[129]}]
set_load -pin_load 0.1900 [get_ports {mports_o[128]}]
set_load -pin_load 0.1900 [get_ports {mports_o[127]}]
set_load -pin_load 0.1900 [get_ports {mports_o[126]}]
set_load -pin_load 0.1900 [get_ports {mports_o[125]}]
set_load -pin_load 0.1900 [get_ports {mports_o[124]}]
set_load -pin_load 0.1900 [get_ports {mports_o[123]}]
set_load -pin_load 0.1900 [get_ports {mports_o[122]}]
set_load -pin_load 0.1900 [get_ports {mports_o[121]}]
set_load -pin_load 0.1900 [get_ports {mports_o[120]}]
set_load -pin_load 0.1900 [get_ports {mports_o[119]}]
set_load -pin_load 0.1900 [get_ports {mports_o[118]}]
set_load -pin_load 0.1900 [get_ports {mports_o[117]}]
set_load -pin_load 0.1900 [get_ports {mports_o[116]}]
set_load -pin_load 0.1900 [get_ports {mports_o[115]}]
set_load -pin_load 0.1900 [get_ports {mports_o[114]}]
set_load -pin_load 0.1900 [get_ports {mports_o[113]}]
set_load -pin_load 0.1900 [get_ports {mports_o[112]}]
set_load -pin_load 0.1900 [get_ports {mports_o[111]}]
set_load -pin_load 0.1900 [get_ports {mports_o[110]}]
set_load -pin_load 0.1900 [get_ports {mports_o[109]}]
set_load -pin_load 0.1900 [get_ports {mports_o[108]}]
set_load -pin_load 0.1900 [get_ports {mports_o[107]}]
set_load -pin_load 0.1900 [get_ports {mports_o[106]}]
set_load -pin_load 0.1900 [get_ports {mports_o[105]}]
set_load -pin_load 0.1900 [get_ports {mports_o[104]}]
set_load -pin_load 0.1900 [get_ports {mports_o[103]}]
set_load -pin_load 0.1900 [get_ports {mports_o[102]}]
set_load -pin_load 0.1900 [get_ports {mports_o[101]}]
set_load -pin_load 0.1900 [get_ports {mports_o[100]}]
set_load -pin_load 0.1900 [get_ports {mports_o[99]}]
set_load -pin_load 0.1900 [get_ports {mports_o[98]}]
set_load -pin_load 0.1900 [get_ports {mports_o[97]}]
set_load -pin_load 0.1900 [get_ports {mports_o[96]}]
set_load -pin_load 0.1900 [get_ports {mports_o[95]}]
set_load -pin_load 0.1900 [get_ports {mports_o[94]}]
set_load -pin_load 0.1900 [get_ports {mports_o[93]}]
set_load -pin_load 0.1900 [get_ports {mports_o[92]}]
set_load -pin_load 0.1900 [get_ports {mports_o[91]}]
set_load -pin_load 0.1900 [get_ports {mports_o[90]}]
set_load -pin_load 0.1900 [get_ports {mports_o[89]}]
set_load -pin_load 0.1900 [get_ports {mports_o[88]}]
set_load -pin_load 0.1900 [get_ports {mports_o[87]}]
set_load -pin_load 0.1900 [get_ports {mports_o[86]}]
set_load -pin_load 0.1900 [get_ports {mports_o[85]}]
set_load -pin_load 0.1900 [get_ports {mports_o[84]}]
set_load -pin_load 0.1900 [get_ports {mports_o[83]}]
set_load -pin_load 0.1900 [get_ports {mports_o[82]}]
set_load -pin_load 0.1900 [get_ports {mports_o[81]}]
set_load -pin_load 0.1900 [get_ports {mports_o[80]}]
set_load -pin_load 0.1900 [get_ports {mports_o[79]}]
set_load -pin_load 0.1900 [get_ports {mports_o[78]}]
set_load -pin_load 0.1900 [get_ports {mports_o[77]}]
set_load -pin_load 0.1900 [get_ports {mports_o[76]}]
set_load -pin_load 0.1900 [get_ports {mports_o[75]}]
set_load -pin_load 0.1900 [get_ports {mports_o[74]}]
set_load -pin_load 0.1900 [get_ports {mports_o[73]}]
set_load -pin_load 0.1900 [get_ports {mports_o[72]}]
set_load -pin_load 0.1900 [get_ports {mports_o[71]}]
set_load -pin_load 0.1900 [get_ports {mports_o[70]}]
set_load -pin_load 0.1900 [get_ports {mports_o[69]}]
set_load -pin_load 0.1900 [get_ports {mports_o[68]}]
set_load -pin_load 0.1900 [get_ports {mports_o[67]}]
set_load -pin_load 0.1900 [get_ports {mports_o[66]}]
set_load -pin_load 0.1900 [get_ports {mports_o[65]}]
set_load -pin_load 0.1900 [get_ports {mports_o[64]}]
set_load -pin_load 0.1900 [get_ports {mports_o[63]}]
set_load -pin_load 0.1900 [get_ports {mports_o[62]}]
set_load -pin_load 0.1900 [get_ports {mports_o[61]}]
set_load -pin_load 0.1900 [get_ports {mports_o[60]}]
set_load -pin_load 0.1900 [get_ports {mports_o[59]}]
set_load -pin_load 0.1900 [get_ports {mports_o[58]}]
set_load -pin_load 0.1900 [get_ports {mports_o[57]}]
set_load -pin_load 0.1900 [get_ports {mports_o[56]}]
set_load -pin_load 0.1900 [get_ports {mports_o[55]}]
set_load -pin_load 0.1900 [get_ports {mports_o[54]}]
set_load -pin_load 0.1900 [get_ports {mports_o[53]}]
set_load -pin_load 0.1900 [get_ports {mports_o[52]}]
set_load -pin_load 0.1900 [get_ports {mports_o[51]}]
set_load -pin_load 0.1900 [get_ports {mports_o[50]}]
set_load -pin_load 0.1900 [get_ports {mports_o[49]}]
set_load -pin_load 0.1900 [get_ports {mports_o[48]}]
set_load -pin_load 0.1900 [get_ports {mports_o[47]}]
set_load -pin_load 0.1900 [get_ports {mports_o[46]}]
set_load -pin_load 0.1900 [get_ports {mports_o[45]}]
set_load -pin_load 0.1900 [get_ports {mports_o[44]}]
set_load -pin_load 0.1900 [get_ports {mports_o[43]}]
set_load -pin_load 0.1900 [get_ports {mports_o[42]}]
set_load -pin_load 0.1900 [get_ports {mports_o[41]}]
set_load -pin_load 0.1900 [get_ports {mports_o[40]}]
set_load -pin_load 0.1900 [get_ports {mports_o[39]}]
set_load -pin_load 0.1900 [get_ports {mports_o[38]}]
set_load -pin_load 0.1900 [get_ports {mports_o[37]}]
set_load -pin_load 0.1900 [get_ports {mports_o[36]}]
set_load -pin_load 0.1900 [get_ports {mports_o[35]}]
set_load -pin_load 0.1900 [get_ports {mports_o[34]}]
set_load -pin_load 0.1900 [get_ports {mports_o[33]}]
set_load -pin_load 0.1900 [get_ports {mports_o[32]}]
set_load -pin_load 0.1900 [get_ports {mports_o[31]}]
set_load -pin_load 0.1900 [get_ports {mports_o[30]}]
set_load -pin_load 0.1900 [get_ports {mports_o[29]}]
set_load -pin_load 0.1900 [get_ports {mports_o[28]}]
set_load -pin_load 0.1900 [get_ports {mports_o[27]}]
set_load -pin_load 0.1900 [get_ports {mports_o[26]}]
set_load -pin_load 0.1900 [get_ports {mports_o[25]}]
set_load -pin_load 0.1900 [get_ports {mports_o[24]}]
set_load -pin_load 0.1900 [get_ports {mports_o[23]}]
set_load -pin_load 0.1900 [get_ports {mports_o[22]}]
set_load -pin_load 0.1900 [get_ports {mports_o[21]}]
set_load -pin_load 0.1900 [get_ports {mports_o[20]}]
set_load -pin_load 0.1900 [get_ports {mports_o[19]}]
set_load -pin_load 0.1900 [get_ports {mports_o[18]}]
set_load -pin_load 0.1900 [get_ports {mports_o[17]}]
set_load -pin_load 0.1900 [get_ports {mports_o[16]}]
set_load -pin_load 0.1900 [get_ports {mports_o[15]}]
set_load -pin_load 0.1900 [get_ports {mports_o[14]}]
set_load -pin_load 0.1900 [get_ports {mports_o[13]}]
set_load -pin_load 0.1900 [get_ports {mports_o[12]}]
set_load -pin_load 0.1900 [get_ports {mports_o[11]}]
set_load -pin_load 0.1900 [get_ports {mports_o[10]}]
set_load -pin_load 0.1900 [get_ports {mports_o[9]}]
set_load -pin_load 0.1900 [get_ports {mports_o[8]}]
set_load -pin_load 0.1900 [get_ports {mports_o[7]}]
set_load -pin_load 0.1900 [get_ports {mports_o[6]}]
set_load -pin_load 0.1900 [get_ports {mports_o[5]}]
set_load -pin_load 0.1900 [get_ports {mports_o[4]}]
set_load -pin_load 0.1900 [get_ports {mports_o[3]}]
set_load -pin_load 0.1900 [get_ports {mports_o[2]}]
set_load -pin_load 0.1900 [get_ports {mports_o[1]}]
set_load -pin_load 0.1900 [get_ports {mports_o[0]}]
set_load -pin_load 0.1900 [get_ports {sports_o[227]}]
set_load -pin_load 0.1900 [get_ports {sports_o[226]}]
set_load -pin_load 0.1900 [get_ports {sports_o[225]}]
set_load -pin_load 0.1900 [get_ports {sports_o[224]}]
set_load -pin_load 0.1900 [get_ports {sports_o[223]}]
set_load -pin_load 0.1900 [get_ports {sports_o[222]}]
set_load -pin_load 0.1900 [get_ports {sports_o[221]}]
set_load -pin_load 0.1900 [get_ports {sports_o[220]}]
set_load -pin_load 0.1900 [get_ports {sports_o[219]}]
set_load -pin_load 0.1900 [get_ports {sports_o[218]}]
set_load -pin_load 0.1900 [get_ports {sports_o[217]}]
set_load -pin_load 0.1900 [get_ports {sports_o[216]}]
set_load -pin_load 0.1900 [get_ports {sports_o[215]}]
set_load -pin_load 0.1900 [get_ports {sports_o[214]}]
set_load -pin_load 0.1900 [get_ports {sports_o[213]}]
set_load -pin_load 0.1900 [get_ports {sports_o[212]}]
set_load -pin_load 0.1900 [get_ports {sports_o[211]}]
set_load -pin_load 0.1900 [get_ports {sports_o[210]}]
set_load -pin_load 0.1900 [get_ports {sports_o[209]}]
set_load -pin_load 0.1900 [get_ports {sports_o[208]}]
set_load -pin_load 0.1900 [get_ports {sports_o[207]}]
set_load -pin_load 0.1900 [get_ports {sports_o[206]}]
set_load -pin_load 0.1900 [get_ports {sports_o[205]}]
set_load -pin_load 0.1900 [get_ports {sports_o[204]}]
set_load -pin_load 0.1900 [get_ports {sports_o[203]}]
set_load -pin_load 0.1900 [get_ports {sports_o[202]}]
set_load -pin_load 0.1900 [get_ports {sports_o[201]}]
set_load -pin_load 0.1900 [get_ports {sports_o[200]}]
set_load -pin_load 0.1900 [get_ports {sports_o[199]}]
set_load -pin_load 0.1900 [get_ports {sports_o[198]}]
set_load -pin_load 0.1900 [get_ports {sports_o[197]}]
set_load -pin_load 0.1900 [get_ports {sports_o[196]}]
set_load -pin_load 0.1900 [get_ports {sports_o[195]}]
set_load -pin_load 0.1900 [get_ports {sports_o[194]}]
set_load -pin_load 0.1900 [get_ports {sports_o[193]}]
set_load -pin_load 0.1900 [get_ports {sports_o[192]}]
set_load -pin_load 0.1900 [get_ports {sports_o[191]}]
set_load -pin_load 0.1900 [get_ports {sports_o[190]}]
set_load -pin_load 0.1900 [get_ports {sports_o[189]}]
set_load -pin_load 0.1900 [get_ports {sports_o[188]}]
set_load -pin_load 0.1900 [get_ports {sports_o[187]}]
set_load -pin_load 0.1900 [get_ports {sports_o[186]}]
set_load -pin_load 0.1900 [get_ports {sports_o[185]}]
set_load -pin_load 0.1900 [get_ports {sports_o[184]}]
set_load -pin_load 0.1900 [get_ports {sports_o[183]}]
set_load -pin_load 0.1900 [get_ports {sports_o[182]}]
set_load -pin_load 0.1900 [get_ports {sports_o[181]}]
set_load -pin_load 0.1900 [get_ports {sports_o[180]}]
set_load -pin_load 0.1900 [get_ports {sports_o[179]}]
set_load -pin_load 0.1900 [get_ports {sports_o[178]}]
set_load -pin_load 0.1900 [get_ports {sports_o[177]}]
set_load -pin_load 0.1900 [get_ports {sports_o[176]}]
set_load -pin_load 0.1900 [get_ports {sports_o[175]}]
set_load -pin_load 0.1900 [get_ports {sports_o[174]}]
set_load -pin_load 0.1900 [get_ports {sports_o[173]}]
set_load -pin_load 0.1900 [get_ports {sports_o[172]}]
set_load -pin_load 0.1900 [get_ports {sports_o[171]}]
set_load -pin_load 0.1900 [get_ports {sports_o[170]}]
set_load -pin_load 0.1900 [get_ports {sports_o[169]}]
set_load -pin_load 0.1900 [get_ports {sports_o[168]}]
set_load -pin_load 0.1900 [get_ports {sports_o[167]}]
set_load -pin_load 0.1900 [get_ports {sports_o[166]}]
set_load -pin_load 0.1900 [get_ports {sports_o[165]}]
set_load -pin_load 0.1900 [get_ports {sports_o[164]}]
set_load -pin_load 0.1900 [get_ports {sports_o[163]}]
set_load -pin_load 0.1900 [get_ports {sports_o[162]}]
set_load -pin_load 0.1900 [get_ports {sports_o[161]}]
set_load -pin_load 0.1900 [get_ports {sports_o[160]}]
set_load -pin_load 0.1900 [get_ports {sports_o[159]}]
set_load -pin_load 0.1900 [get_ports {sports_o[158]}]
set_load -pin_load 0.1900 [get_ports {sports_o[157]}]
set_load -pin_load 0.1900 [get_ports {sports_o[156]}]
set_load -pin_load 0.1900 [get_ports {sports_o[155]}]
set_load -pin_load 0.1900 [get_ports {sports_o[154]}]
set_load -pin_load 0.1900 [get_ports {sports_o[153]}]
set_load -pin_load 0.1900 [get_ports {sports_o[152]}]
set_load -pin_load 0.1900 [get_ports {sports_o[151]}]
set_load -pin_load 0.1900 [get_ports {sports_o[150]}]
set_load -pin_load 0.1900 [get_ports {sports_o[149]}]
set_load -pin_load 0.1900 [get_ports {sports_o[148]}]
set_load -pin_load 0.1900 [get_ports {sports_o[147]}]
set_load -pin_load 0.1900 [get_ports {sports_o[146]}]
set_load -pin_load 0.1900 [get_ports {sports_o[145]}]
set_load -pin_load 0.1900 [get_ports {sports_o[144]}]
set_load -pin_load 0.1900 [get_ports {sports_o[143]}]
set_load -pin_load 0.1900 [get_ports {sports_o[142]}]
set_load -pin_load 0.1900 [get_ports {sports_o[141]}]
set_load -pin_load 0.1900 [get_ports {sports_o[140]}]
set_load -pin_load 0.1900 [get_ports {sports_o[139]}]
set_load -pin_load 0.1900 [get_ports {sports_o[138]}]
set_load -pin_load 0.1900 [get_ports {sports_o[137]}]
set_load -pin_load 0.1900 [get_ports {sports_o[136]}]
set_load -pin_load 0.1900 [get_ports {sports_o[135]}]
set_load -pin_load 0.1900 [get_ports {sports_o[134]}]
set_load -pin_load 0.1900 [get_ports {sports_o[133]}]
set_load -pin_load 0.1900 [get_ports {sports_o[132]}]
set_load -pin_load 0.1900 [get_ports {sports_o[131]}]
set_load -pin_load 0.1900 [get_ports {sports_o[130]}]
set_load -pin_load 0.1900 [get_ports {sports_o[129]}]
set_load -pin_load 0.1900 [get_ports {sports_o[128]}]
set_load -pin_load 0.1900 [get_ports {sports_o[127]}]
set_load -pin_load 0.1900 [get_ports {sports_o[126]}]
set_load -pin_load 0.1900 [get_ports {sports_o[125]}]
set_load -pin_load 0.1900 [get_ports {sports_o[124]}]
set_load -pin_load 0.1900 [get_ports {sports_o[123]}]
set_load -pin_load 0.1900 [get_ports {sports_o[122]}]
set_load -pin_load 0.1900 [get_ports {sports_o[121]}]
set_load -pin_load 0.1900 [get_ports {sports_o[120]}]
set_load -pin_load 0.1900 [get_ports {sports_o[119]}]
set_load -pin_load 0.1900 [get_ports {sports_o[118]}]
set_load -pin_load 0.1900 [get_ports {sports_o[117]}]
set_load -pin_load 0.1900 [get_ports {sports_o[116]}]
set_load -pin_load 0.1900 [get_ports {sports_o[115]}]
set_load -pin_load 0.1900 [get_ports {sports_o[114]}]
set_load -pin_load 0.1900 [get_ports {sports_o[113]}]
set_load -pin_load 0.1900 [get_ports {sports_o[112]}]
set_load -pin_load 0.1900 [get_ports {sports_o[111]}]
set_load -pin_load 0.1900 [get_ports {sports_o[110]}]
set_load -pin_load 0.1900 [get_ports {sports_o[109]}]
set_load -pin_load 0.1900 [get_ports {sports_o[108]}]
set_load -pin_load 0.1900 [get_ports {sports_o[107]}]
set_load -pin_load 0.1900 [get_ports {sports_o[106]}]
set_load -pin_load 0.1900 [get_ports {sports_o[105]}]
set_load -pin_load 0.1900 [get_ports {sports_o[104]}]
set_load -pin_load 0.1900 [get_ports {sports_o[103]}]
set_load -pin_load 0.1900 [get_ports {sports_o[102]}]
set_load -pin_load 0.1900 [get_ports {sports_o[101]}]
set_load -pin_load 0.1900 [get_ports {sports_o[100]}]
set_load -pin_load 0.1900 [get_ports {sports_o[99]}]
set_load -pin_load 0.1900 [get_ports {sports_o[98]}]
set_load -pin_load 0.1900 [get_ports {sports_o[97]}]
set_load -pin_load 0.1900 [get_ports {sports_o[96]}]
set_load -pin_load 0.1900 [get_ports {sports_o[95]}]
set_load -pin_load 0.1900 [get_ports {sports_o[94]}]
set_load -pin_load 0.1900 [get_ports {sports_o[93]}]
set_load -pin_load 0.1900 [get_ports {sports_o[92]}]
set_load -pin_load 0.1900 [get_ports {sports_o[91]}]
set_load -pin_load 0.1900 [get_ports {sports_o[90]}]
set_load -pin_load 0.1900 [get_ports {sports_o[89]}]
set_load -pin_load 0.1900 [get_ports {sports_o[88]}]
set_load -pin_load 0.1900 [get_ports {sports_o[87]}]
set_load -pin_load 0.1900 [get_ports {sports_o[86]}]
set_load -pin_load 0.1900 [get_ports {sports_o[85]}]
set_load -pin_load 0.1900 [get_ports {sports_o[84]}]
set_load -pin_load 0.1900 [get_ports {sports_o[83]}]
set_load -pin_load 0.1900 [get_ports {sports_o[82]}]
set_load -pin_load 0.1900 [get_ports {sports_o[81]}]
set_load -pin_load 0.1900 [get_ports {sports_o[80]}]
set_load -pin_load 0.1900 [get_ports {sports_o[79]}]
set_load -pin_load 0.1900 [get_ports {sports_o[78]}]
set_load -pin_load 0.1900 [get_ports {sports_o[77]}]
set_load -pin_load 0.1900 [get_ports {sports_o[76]}]
set_load -pin_load 0.1900 [get_ports {sports_o[75]}]
set_load -pin_load 0.1900 [get_ports {sports_o[74]}]
set_load -pin_load 0.1900 [get_ports {sports_o[73]}]
set_load -pin_load 0.1900 [get_ports {sports_o[72]}]
set_load -pin_load 0.1900 [get_ports {sports_o[71]}]
set_load -pin_load 0.1900 [get_ports {sports_o[70]}]
set_load -pin_load 0.1900 [get_ports {sports_o[69]}]
set_load -pin_load 0.1900 [get_ports {sports_o[68]}]
set_load -pin_load 0.1900 [get_ports {sports_o[67]}]
set_load -pin_load 0.1900 [get_ports {sports_o[66]}]
set_load -pin_load 0.1900 [get_ports {sports_o[65]}]
set_load -pin_load 0.1900 [get_ports {sports_o[64]}]
set_load -pin_load 0.1900 [get_ports {sports_o[63]}]
set_load -pin_load 0.1900 [get_ports {sports_o[62]}]
set_load -pin_load 0.1900 [get_ports {sports_o[61]}]
set_load -pin_load 0.1900 [get_ports {sports_o[60]}]
set_load -pin_load 0.1900 [get_ports {sports_o[59]}]
set_load -pin_load 0.1900 [get_ports {sports_o[58]}]
set_load -pin_load 0.1900 [get_ports {sports_o[57]}]
set_load -pin_load 0.1900 [get_ports {sports_o[56]}]
set_load -pin_load 0.1900 [get_ports {sports_o[55]}]
set_load -pin_load 0.1900 [get_ports {sports_o[54]}]
set_load -pin_load 0.1900 [get_ports {sports_o[53]}]
set_load -pin_load 0.1900 [get_ports {sports_o[52]}]
set_load -pin_load 0.1900 [get_ports {sports_o[51]}]
set_load -pin_load 0.1900 [get_ports {sports_o[50]}]
set_load -pin_load 0.1900 [get_ports {sports_o[49]}]
set_load -pin_load 0.1900 [get_ports {sports_o[48]}]
set_load -pin_load 0.1900 [get_ports {sports_o[47]}]
set_load -pin_load 0.1900 [get_ports {sports_o[46]}]
set_load -pin_load 0.1900 [get_ports {sports_o[45]}]
set_load -pin_load 0.1900 [get_ports {sports_o[44]}]
set_load -pin_load 0.1900 [get_ports {sports_o[43]}]
set_load -pin_load 0.1900 [get_ports {sports_o[42]}]
set_load -pin_load 0.1900 [get_ports {sports_o[41]}]
set_load -pin_load 0.1900 [get_ports {sports_o[40]}]
set_load -pin_load 0.1900 [get_ports {sports_o[39]}]
set_load -pin_load 0.1900 [get_ports {sports_o[38]}]
set_load -pin_load 0.1900 [get_ports {sports_o[37]}]
set_load -pin_load 0.1900 [get_ports {sports_o[36]}]
set_load -pin_load 0.1900 [get_ports {sports_o[35]}]
set_load -pin_load 0.1900 [get_ports {sports_o[34]}]
set_load -pin_load 0.1900 [get_ports {sports_o[33]}]
set_load -pin_load 0.1900 [get_ports {sports_o[32]}]
set_load -pin_load 0.1900 [get_ports {sports_o[31]}]
set_load -pin_load 0.1900 [get_ports {sports_o[30]}]
set_load -pin_load 0.1900 [get_ports {sports_o[29]}]
set_load -pin_load 0.1900 [get_ports {sports_o[28]}]
set_load -pin_load 0.1900 [get_ports {sports_o[27]}]
set_load -pin_load 0.1900 [get_ports {sports_o[26]}]
set_load -pin_load 0.1900 [get_ports {sports_o[25]}]
set_load -pin_load 0.1900 [get_ports {sports_o[24]}]
set_load -pin_load 0.1900 [get_ports {sports_o[23]}]
set_load -pin_load 0.1900 [get_ports {sports_o[22]}]
set_load -pin_load 0.1900 [get_ports {sports_o[21]}]
set_load -pin_load 0.1900 [get_ports {sports_o[20]}]
set_load -pin_load 0.1900 [get_ports {sports_o[19]}]
set_load -pin_load 0.1900 [get_ports {sports_o[18]}]
set_load -pin_load 0.1900 [get_ports {sports_o[17]}]
set_load -pin_load 0.1900 [get_ports {sports_o[16]}]
set_load -pin_load 0.1900 [get_ports {sports_o[15]}]
set_load -pin_load 0.1900 [get_ports {sports_o[14]}]
set_load -pin_load 0.1900 [get_ports {sports_o[13]}]
set_load -pin_load 0.1900 [get_ports {sports_o[12]}]
set_load -pin_load 0.1900 [get_ports {sports_o[11]}]
set_load -pin_load 0.1900 [get_ports {sports_o[10]}]
set_load -pin_load 0.1900 [get_ports {sports_o[9]}]
set_load -pin_load 0.1900 [get_ports {sports_o[8]}]
set_load -pin_load 0.1900 [get_ports {sports_o[7]}]
set_load -pin_load 0.1900 [get_ports {sports_o[6]}]
set_load -pin_load 0.1900 [get_ports {sports_o[5]}]
set_load -pin_load 0.1900 [get_ports {sports_o[4]}]
set_load -pin_load 0.1900 [get_ports {sports_o[3]}]
set_load -pin_load 0.1900 [get_ports {sports_o[2]}]
set_load -pin_load 0.1900 [get_ports {sports_o[1]}]
set_load -pin_load 0.1900 [get_ports {sports_o[0]}]
set_input_transition 0.6100 [get_ports {clk_i}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
