###############################################################################
# Created by write_sdc
# Tue Oct 21 21:41:50 2025
###############################################################################
current_design vga
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk_i}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {hsync_o}]
set_load -pin_load 0.1900 [get_ports {vsync_o}]
set_load -pin_load 0.1900 [get_ports {mport_o[68]}]
set_load -pin_load 0.1900 [get_ports {mport_o[67]}]
set_load -pin_load 0.1900 [get_ports {mport_o[66]}]
set_load -pin_load 0.1900 [get_ports {mport_o[65]}]
set_load -pin_load 0.1900 [get_ports {mport_o[64]}]
set_load -pin_load 0.1900 [get_ports {mport_o[63]}]
set_load -pin_load 0.1900 [get_ports {mport_o[62]}]
set_load -pin_load 0.1900 [get_ports {mport_o[61]}]
set_load -pin_load 0.1900 [get_ports {mport_o[60]}]
set_load -pin_load 0.1900 [get_ports {mport_o[59]}]
set_load -pin_load 0.1900 [get_ports {mport_o[58]}]
set_load -pin_load 0.1900 [get_ports {mport_o[57]}]
set_load -pin_load 0.1900 [get_ports {mport_o[56]}]
set_load -pin_load 0.1900 [get_ports {mport_o[55]}]
set_load -pin_load 0.1900 [get_ports {mport_o[54]}]
set_load -pin_load 0.1900 [get_ports {mport_o[53]}]
set_load -pin_load 0.1900 [get_ports {mport_o[52]}]
set_load -pin_load 0.1900 [get_ports {mport_o[51]}]
set_load -pin_load 0.1900 [get_ports {mport_o[50]}]
set_load -pin_load 0.1900 [get_ports {mport_o[49]}]
set_load -pin_load 0.1900 [get_ports {mport_o[48]}]
set_load -pin_load 0.1900 [get_ports {mport_o[47]}]
set_load -pin_load 0.1900 [get_ports {mport_o[46]}]
set_load -pin_load 0.1900 [get_ports {mport_o[45]}]
set_load -pin_load 0.1900 [get_ports {mport_o[44]}]
set_load -pin_load 0.1900 [get_ports {mport_o[43]}]
set_load -pin_load 0.1900 [get_ports {mport_o[42]}]
set_load -pin_load 0.1900 [get_ports {mport_o[41]}]
set_load -pin_load 0.1900 [get_ports {mport_o[40]}]
set_load -pin_load 0.1900 [get_ports {mport_o[39]}]
set_load -pin_load 0.1900 [get_ports {mport_o[38]}]
set_load -pin_load 0.1900 [get_ports {mport_o[37]}]
set_load -pin_load 0.1900 [get_ports {mport_o[36]}]
set_load -pin_load 0.1900 [get_ports {mport_o[35]}]
set_load -pin_load 0.1900 [get_ports {mport_o[34]}]
set_load -pin_load 0.1900 [get_ports {mport_o[33]}]
set_load -pin_load 0.1900 [get_ports {mport_o[32]}]
set_load -pin_load 0.1900 [get_ports {mport_o[31]}]
set_load -pin_load 0.1900 [get_ports {mport_o[30]}]
set_load -pin_load 0.1900 [get_ports {mport_o[29]}]
set_load -pin_load 0.1900 [get_ports {mport_o[28]}]
set_load -pin_load 0.1900 [get_ports {mport_o[27]}]
set_load -pin_load 0.1900 [get_ports {mport_o[26]}]
set_load -pin_load 0.1900 [get_ports {mport_o[25]}]
set_load -pin_load 0.1900 [get_ports {mport_o[24]}]
set_load -pin_load 0.1900 [get_ports {mport_o[23]}]
set_load -pin_load 0.1900 [get_ports {mport_o[22]}]
set_load -pin_load 0.1900 [get_ports {mport_o[21]}]
set_load -pin_load 0.1900 [get_ports {mport_o[20]}]
set_load -pin_load 0.1900 [get_ports {mport_o[19]}]
set_load -pin_load 0.1900 [get_ports {mport_o[18]}]
set_load -pin_load 0.1900 [get_ports {mport_o[17]}]
set_load -pin_load 0.1900 [get_ports {mport_o[16]}]
set_load -pin_load 0.1900 [get_ports {mport_o[15]}]
set_load -pin_load 0.1900 [get_ports {mport_o[14]}]
set_load -pin_load 0.1900 [get_ports {mport_o[13]}]
set_load -pin_load 0.1900 [get_ports {mport_o[12]}]
set_load -pin_load 0.1900 [get_ports {mport_o[11]}]
set_load -pin_load 0.1900 [get_ports {mport_o[10]}]
set_load -pin_load 0.1900 [get_ports {mport_o[9]}]
set_load -pin_load 0.1900 [get_ports {mport_o[8]}]
set_load -pin_load 0.1900 [get_ports {mport_o[7]}]
set_load -pin_load 0.1900 [get_ports {mport_o[6]}]
set_load -pin_load 0.1900 [get_ports {mport_o[5]}]
set_load -pin_load 0.1900 [get_ports {mport_o[4]}]
set_load -pin_load 0.1900 [get_ports {mport_o[3]}]
set_load -pin_load 0.1900 [get_ports {mport_o[2]}]
set_load -pin_load 0.1900 [get_ports {mport_o[1]}]
set_load -pin_load 0.1900 [get_ports {mport_o[0]}]
set_load -pin_load 0.1900 [get_ports {pixel_o[7]}]
set_load -pin_load 0.1900 [get_ports {pixel_o[6]}]
set_load -pin_load 0.1900 [get_ports {pixel_o[5]}]
set_load -pin_load 0.1900 [get_ports {pixel_o[4]}]
set_load -pin_load 0.1900 [get_ports {pixel_o[3]}]
set_load -pin_load 0.1900 [get_ports {pixel_o[2]}]
set_load -pin_load 0.1900 [get_ports {pixel_o[1]}]
set_load -pin_load 0.1900 [get_ports {pixel_o[0]}]
set_input_transition 0.6100 [get_ports {clk_i}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
